# BuiltInFailures.SteelElementsFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SteelElementsFailures Class
BuiltInFailures Class Members See Also
---
Failures about SteelElement module
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SteelElementsFailures
```

Visual Basic
---
```text
Public NotInheritable Class SteelElementsFailures
```

Visual C++
---
```text
public ref class SteelElementsFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SteelElementsFailures
# See Also
BuiltInFailures..::..SteelElementsFailures Members
Autodesk.Revit.DB Namespace